#+TITLE: SWITCH STATEMENTS
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++ (Spring 2023)
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:1 ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :exports both :results output :noweb yes :tangle yes
* Simple example

- In the example program below, the ~grade~ is set in the variable
  declaration. Depending on the value, a =case= is triggered and the
  corresponding statements are executed.

- What is the output of the code below for ~grade =~ 5,3,0,-1,0.5?
  #+begin_quote
  | VALUE | OUTPUT        |
  |-------+---------------|
  |     5 | Failing       |
  |     3 | Passing       |
  |     0 | Illegal grade |
  |    -1 | Illegal grade |
  |   0.5 | Illegal grade |
  #+end_quote

- The code:
  #+name: switch
  #+begin_src C :results output :exports both
    int grade = 0.5;
    switch (grade) {
     case 4:
     case 3:
     case 2:
     case 1:
       printf("Passing");
       break;
     case 5:
     case 6:
       printf("Failing");
       break;
     default:
       printf("Illegal grade");
       break;
     }
  #+end_src

  #+RESULTS: switch
  : Illegal grade

- What does this program do? Which problem/solution is implemented?
  #+begin_quote
  Answer: The program reflects "passing" grades 4,3,2,1, and "failing"
  grade 5,6. Any other grade value is not allowed. (This happens to be
  the German grade scale, which is A = 1 to D = 4, and F = 5 or 6.)
  #+end_quote

- You can also put several case labels on the same line as shown
  below - the code is otherwise identical to the previous one:

  #+name: switch1
  #+begin_src C :results output :exports both
    int grade = 3;

    switch (grade) {
     case 4: case 3: case 2: case 1:
       printf("Passing");
       break;
     case 5: case 6:
       printf("Failing");
       break;
     default:
       printf("Illegal grade");
       break;
     }
  #+end_src

- Note: You cannot write a case label for a range of values.

- The default case (when none of the case expressions apply) is
  optional, and it does not have to come last.

* The role of the ~break~ statement

- The ~switch~ statement is a /controlled jump/. The ~case~ label is a
  marker indicating a position within the switch.

- Let's run the previous program again, without the ~break~
  statements. What do you think the output will be?
  #+name: switch2
  #+begin_src C :results output :exports both
    int grade = 5;

    switch (grade) {
      // cases 4,3,2,1 all lead to a passing grade
     case 4:
     case 3:
     case 2:
     case 1:
       printf("Passing");
     case 5:
     case 6:
       printf("Failing");
     default:
       printf("Illegal grade");
     }
  #+end_src

  #+RESULTS: switch2
  : FailingIllegal grade

- What happens without the ~break~ statements?
  #+begin_quote
  Answer: When the last statement in a case has been executed,
  control falls through to the first statement in the following
  case; its case label is ignored. Without ~break~ (or some other
  jump statement, like ~return~ or ~goto~, control flows from one
  case to the next.
  #+end_quote

- Deliberate falling through (omission of ~break~) should be
  indicated with an explicit comment.

